#### 📖 Terraform Plan ('infra/github-runner/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.container_app_job_selfhosted_runner.module.container_app_job_selfhosted_runner.azapi_resource.container_app_job will be created
  + resource "azapi_resource" "container_app_job" {
      + body                      = jsonencode(
            {
              + properties = {
                  + configuration = {
                      + eventTriggerConfig = {
                          + parallelism            = 1
                          + replicaCompletionCount = 1
                          + scale                  = {
                              + maxExecutions   = 5
                              + minExecutions   = 0
                              + pollingInterval = 30
                              + rules           = [
                                  + {
                                      + auth     = [
                                          + {
                                              + secretRef        = "personal-access-token"
                                              + triggerParameter = "personalAccessToken"
                                            },
                                        ]
                                      + metadata = {
                                          + github-runner             = "https://api.github.com"
                                          + owner                     = "pagopa"
                                          + repos                     = "io-wallet"
                                          + runnerScope               = "repo"
                                          + targetWorkflowQueueLength = "1"
                                        }
                                      + name     = "io-p-wallet-github-runner-rule"
                                      + type     = "github-runner"
                                    },
                                ]
                            }
                        }
                      + replicaRetryLimit  = 1
                      + replicaTimeout     = 1800
                      + secrets            = [
                          + {
                              + identity    = "system"
                              + keyVaultUrl = "https://io-p-kv-common.vault.azure.net/secrets/github-runner-pat"
                              + name        = "personal-access-token"
                            },
                        ]
                      + triggerType        = "Event"
                    }
                  + environmentId = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-github-runner-rg/providers/Microsoft.App/managedEnvironments/io-p-github-runner-cae"
                  + template      = {
                      + containers = [
                          + {
                              + env       = [
                                  + {
                                      + name      = "GITHUB_PAT"
                                      + secretRef = "personal-access-token"
                                    },
                                  + {
                                      + name  = "REPO_URL"
                                      + value = "https://github.com/pagopa/io-wallet"
                                    },
                                  + {
                                      + name  = "REGISTRATION_TOKEN_API_URL"
                                      + value = "https://api.github.com/repos/pagopa/io-wallet/actions/runners/registration-token"
                                    },
                                ]
                              + image     = "ghcr.io/pagopa/github-self-hosted-runner-azure:latest"
                              + name      = "io-p-wallet-runner"
                              + resources = {
                                  + cpu    = 0.5
                                  + memory = "1Gi"
                                }
                            },
                        ]
                    }
                }
            }
        )
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "westeurope"
      + name                      = "io-p-wallet-ca-job"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-github-runner-rg"
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/infra/github-runner/prod"
        }
      + type                      = "Microsoft.App/jobs@2023-05-01"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.container_app_job_selfhosted_runner.module.container_app_job_selfhosted_runner.azurerm_key_vault_access_policy.keyvault_containerapp will be created
  + resource "azurerm_key_vault_access_policy" "keyvault_containerapp" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common"
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
        ]
      + tenant_id          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + container_app_job = {
      + id                  = (known after apply)
      + name                = "io-p-wallet-ca-job"
      + resource_group_name = "io-p-github-runner-rg"
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
